ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/startup/iar/startup_MDR1986VK01_DC.s
        PUBWEAK UART1_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_EINTR_IRQHandler
        B UART1_EINTR_IRQHandler

        PUBWEAK UART1_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_RTINTR_IRQHandler
        B UART1_RTINTR_IRQHandler

        PUBWEAK UART1_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_TXINTR_IRQHandler
        B UART1_TXINTR_IRQHandler

        PUBWEAK UART1_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_RXINTR_IRQHandler
        B UART1_RXINTR_IRQHandler

        PUBWEAK UART1_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART1_MSINTR_IRQHandler
        B UART1_MSINTR_IRQHandler

        PUBWEAK UART2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_IRQHandler
        B UART2_IRQHandler

        PUBWEAK UART2_TNBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_TNBSYINTR_IRQHandler
        B UART2_TNBSYINTR_IRQHandler

        PUBWEAK UART2_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_TFEINTR_IRQHandler
        B UART2_TFEINTR_IRQHandler

        PUBWEAK UART2_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_RNEINTR_IRQHandler
        B UART2_RNEINTR_IRQHandler

        PUBWEAK UART2_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_EINTR_IRQHandler
        B UART2_EINTR_IRQHandler

        PUBWEAK UART2_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_RTINTR_IRQHandler
        B UART2_RTINTR_IRQHandler

        PUBWEAK UART2_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_TXINTR_IRQHandler
        B UART2_TXINTR_IRQHandler

        PUBWEAK UART2_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_RXINTR_IRQHandler
        B UART2_RXINTR_IRQHandler

        PUBWEAK UART2_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART2_MSINTR_IRQHandler
        B UART2_MSINTR_IRQHandler

        PUBWEAK UART3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_IRQHandler
        B UART3_IRQHandler

        PUBWEAK UART3_TNBSYINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_TNBSYINTR_IRQHandler
        B UART3_TNBSYINTR_IRQHandler

        PUBWEAK UART3_TFEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_TFEINTR_IRQHandler
        B UART3_TFEINTR_IRQHandler

        PUBWEAK UART3_RNEINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_RNEINTR_IRQHandler
        B UART3_RNEINTR_IRQHandler

        PUBWEAK UART3_EINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_EINTR_IRQHandler
        B UART3_EINTR_IRQHandler

        PUBWEAK UART3_RTINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_RTINTR_IRQHandler
        B UART3_RTINTR_IRQHandler

        PUBWEAK UART3_TXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_TXINTR_IRQHandler
        B UART3_TXINTR_IRQHandler

        PUBWEAK UART3_RXINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_RXINTR_IRQHandler
        B UART3_RXINTR_IRQHandler

        PUBWEAK UART3_MSINTR_IRQHandler
        SECTION .text:CODE:NOROOT(1)
UART3_MSINTR_IRQHandler
        B UART3_MSINTR_IRQHandler

        PUBWEAK USB_IRQHandler
        SECTION .text:CODE:NOROOT(1)
USB_IRQHandler
        B USB_IRQHandler

        PUBWEAK MIL0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
MIL0_IRQHandler
        B MIL0_IRQHandler

        PUBWEAK DAC0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC0_IRQHandler
        B DAC0_IRQHandler

        PUBWEAK DAC1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC1_IRQHandler
        B DAC1_IRQHandler

        PUBWEAK DAC2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC2_IRQHandler
        B DAC2_IRQHandler

        PUBWEAK DAC3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC3_IRQHandler
        B DAC3_IRQHandler

        PUBWEAK DAC0_FIFO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC0_FIFO_IRQHandler
        B DAC0_FIFO_IRQHandler

        PUBWEAK DAC1_FIFO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC1_FIFO_IRQHandler
        B DAC1_FIFO_IRQHandler

        PUBWEAK DAC2_FIFO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC2_FIFO_IRQHandler
        B DAC2_FIFO_IRQHandler

        PUBWEAK DAC3_FIFO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
DAC3_FIFO_IRQHandler
        B DAC3_FIFO_IRQHandler

        PUBWEAK TIMER0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
TIMER0_IRQHandler
        B TIMER0_IRQHandler

        PUBWEAK TIMER1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
TIMER1_IRQHandler
        B TIMER1_IRQHandler

        PUBWEAK TIMER2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
TIMER2_IRQHandler
        B TIMER2_IRQHandler

        PUBWEAK TIMER3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
TIMER3_IRQHandler
        B TIMER3_IRQHandler

        PUBWEAK QEP0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
QEP0_IRQHandler
        B QEP0_IRQHandler

        PUBWEAK QEP1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
QEP1_IRQHandler
        B QEP1_IRQHandler

        PUBWEAK CAP0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAP0_IRQHandler
        B CAP0_IRQHandler

        PUBWEAK CAP1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAP1_IRQHandler
        B CAP1_IRQHandler

        PUBWEAK CAP2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAP2_IRQHandler
        B CAP2_IRQHandler

        PUBWEAK CAP3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CAP3_IRQHandler
        B CAP3_IRQHandler

        PUBWEAK EPWM8_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM8_IRQHandler
        B EPWM8_IRQHandler

        PUBWEAK EPWM7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM7_IRQHandler
        B EPWM7_IRQHandler

        PUBWEAK EPWM6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM6_IRQHandler
        B EPWM6_IRQHandler

        PUBWEAK EPWM5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM5_IRQHandler
        B EPWM5_IRQHandler

        PUBWEAK EPWM4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM4_IRQHandler
        B EPWM4_IRQHandler

        PUBWEAK EPWM3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM3_IRQHandler
        B EPWM3_IRQHandler

        PUBWEAK EPWM2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM2_IRQHandler
        B EPWM2_IRQHandler

        PUBWEAK EPWM1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM1_IRQHandler
        B EPWM1_IRQHandler

        PUBWEAK EPWM0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM0_IRQHandler
        B EPWM0_IRQHandler

        PUBWEAK EPWM_TZ8_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ8_IRQHandler
        B EPWM_TZ8_IRQHandler

