ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/CMSIS/MDR1986VK01/DeviceSupport/startup/iar/startup_MDR1986VK01_DC.s
        PUBWEAK EPWM_TZ7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ7_IRQHandler
        B EPWM_TZ7_IRQHandler

        PUBWEAK EPWM_TZ6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ6_IRQHandler
        B EPWM_TZ6_IRQHandler

        PUBWEAK EPWM_TZ5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ5_IRQHandler
        B EPWM_TZ5_IRQHandler

        PUBWEAK EPWM_TZ4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ4_IRQHandler
        B EPWM_TZ4_IRQHandler

        PUBWEAK EPWM_TZ3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ3_IRQHandler
        B EPWM_TZ3_IRQHandler

        PUBWEAK EPWM_TZ2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ2_IRQHandler
        B EPWM_TZ2_IRQHandler

        PUBWEAK EPWM_TZ1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ1_IRQHandler
        B EPWM_TZ1_IRQHandler

        PUBWEAK EPWM_TZ0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_TZ0_IRQHandler
        B EPWM_TZ0_IRQHandler

        PUBWEAK EPWM_FIFO8_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO8_IRQHandler
        B EPWM_FIFO8_IRQHandler

        PUBWEAK EPWM_FIFO7_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO7_IRQHandler
        B EPWM_FIFO7_IRQHandler

        PUBWEAK EPWM_FIFO6_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO6_IRQHandler
        B EPWM_FIFO6_IRQHandler

        PUBWEAK EPWM_FIFO5_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO5_IRQHandler
        B EPWM_FIFO5_IRQHandler

        PUBWEAK EPWM_FIFO4_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO4_IRQHandler
        B EPWM_FIFO4_IRQHandler

        PUBWEAK EPWM_FIFO3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO3_IRQHandler
        B EPWM_FIFO3_IRQHandler

        PUBWEAK EPWM_FIFO2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO2_IRQHandler
        B EPWM_FIFO2_IRQHandler

        PUBWEAK EPWM_FIFO1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO1_IRQHandler
        B EPWM_FIFO1_IRQHandler

        PUBWEAK EPWM_FIFO0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
EPWM_FIFO0_IRQHandler
        B EPWM_FIFO0_IRQHandler

        PUBWEAK CMP0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CMP0_IRQHandler
        B CMP0_IRQHandler

        PUBWEAK CMP1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CMP1_IRQHandler
        B CMP1_IRQHandler

        PUBWEAK CMP2_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CMP2_IRQHandler
        B CMP2_IRQHandler

        PUBWEAK CMP3_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CMP3_IRQHandler
        B CMP3_IRQHandler

        PUBWEAK ADC12_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC12_IRQHandler
        B ADC12_IRQHandler

        PUBWEAK ADC_FIFO12_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO12_IRQHandler
        B ADC_FIFO12_IRQHandler

        PUBWEAK ADC11_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC11_IRQHandler
        B ADC11_IRQHandler

        PUBWEAK ADC_FIFO11_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO11_IRQHandler
        B ADC_FIFO11_IRQHandler

        PUBWEAK ADC10_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC10_IRQHandler
        B ADC10_IRQHandler

        PUBWEAK ADC_FIFO10_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO10_IRQHandler
        B ADC_FIFO10_IRQHandler

        PUBWEAK ADC02_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC02_IRQHandler
        B ADC02_IRQHandler

        PUBWEAK ADC_FIFO02_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO02_IRQHandler
        B ADC_FIFO02_IRQHandler

        PUBWEAK ADC01_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC01_IRQHandler
        B ADC01_IRQHandler

        PUBWEAK ADC_FIFO01_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO01_IRQHandler
        B ADC_FIFO01_IRQHandler

        PUBWEAK ADC00_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC00_IRQHandler
        B ADC00_IRQHandler

        PUBWEAK ADC_FIFO00_IRQHandler
        SECTION .text:CODE:NOROOT(1)
ADC_FIFO00_IRQHandler
        B ADC_FIFO00_IRQHandler

        PUBWEAK CRCD_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CRCD_IRQHandler
        B CRCD_IRQHandler

        PUBWEAK CANFD_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CANFD_IRQHandler
        B CANFD_IRQHandler

        PUBWEAK MIL1_IRQHandler
        SECTION .text:CODE:NOROOT(1)
MIL1_IRQHandler
        B MIL1_IRQHandler

        PUBWEAK SDIO_IRQHandler
        SECTION .text:CODE:NOROOT(1)
SDIO_IRQHandler
        B SDIO_IRQHandler
        
        PUBWEAK CRPT_FIFO0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CRPT_FIFO0_IRQHandler
        B CRPT_FIFO0_IRQHandler
        
        PUBWEAK CRPT_REG0_IRQHandler
        SECTION .text:CODE:NOROOT(1)
CRPT_REG0_IRQHandler
        B CRPT_REG0_IRQHandler
        
        PUBWEAK CRPT_FIFO1_IRQHandler      
        SECTION .text:CODE:NOROOT(1)
CRPT_FIFO1_IRQHandler      
        B CRPT_FIFO1_IRQHandler      
        
        PUBWEAK CRPT_REG1_IRQHandler      
        SECTION .text:CODE:NOROOT(1)
CRPT_REG1_IRQHandler      
        B CRPT_REG1_IRQHandler 
        
        PUBWEAK CRPT_LOADDONE_IRQHandler      
        SECTION .text:CODE:NOROOT(1)
CRPT_LOADDONE_IRQHandler      
        B CRPT_LOADDONE_IRQHandler
        
        PUBWEAK CRPT_LOCKEDUP_IRQHandler      
        SECTION .text:CODE:NOROOT(1)
CRPT_LOCKEDUP_IRQHandler      
        B CRPT_LOCKEDUP_IRQHandler  

        END
;/******************* (C) COPYRIGHT 2022 Milandr *******************************
;*
;* END OF FILE startup_MLDR32F2C10_DC.s */
